MENU = '=====МЕНЮ ВЫБОРА ФРАКТАЛА====\n\n'
AVAILABLE_FRACTALES = (
    'Доступные фракталы:\n'
    '1: Бегущий квадрат\n'
    '2: Бинарное дерево\n'
    '3: Ветка\n'
    '4: Кривая Коха\n'
    '5: Снежинка Коха\n'
    '6: Кривая Минковского\n'
    '7: Ледяной фрактал (Версия 1)\n'
    '8: Ледяной фрактал (Версия 2)\n'
    '9: Кривая Леви\n'
    '10: Ковер\n'
    '11: H-фрактал\n'
    '12: Фрактал Вичека\n'
)

FRACT_NUMB = 'Введите номер выбранного фрактала: '
ENTER_DEPTH = 'Введите глубину рекурсии: '
ENTER_ANGLE = ('Введите угол поворота квадратов\n'
               '(Рекомендованное зачение 10): ')
ENTER_KOEF = ('Введите коэфициент уменьшения квадратов (0:1)\n'
              '(Рекомендованное зачение 0.15): ')
ENTER_HEIGHT = 'Введите высоту фрактала: '
ENTER_WIDTH = 'Введите ширину фрактала: '
ENTER_SIZE = 'Введите размер фрактала: '
ENTER_X = 'Введите координату x для начала фрактала: '
ENTER_Y = 'Введите координату y для начала фрактала: '
